<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="1,3,240,320" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C,H,W]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="Gather_13196" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="0" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Subtract_3098" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Subtract_3098"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Gather_13199" type="Const" version="opset1">
			<data element_type="f32" shape="16, 3, 3, 3" offset="12" size="1728"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Multiply_12323" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="245, 246, Constant_3099, Divide_3100, base_net.0.0.weight, base_net.0.1.bias, base_net.0.1.running_mean, base_net.0.1.running_var, base_net.0.1.weight"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_12328" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="1740" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="246" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="246, base_net.0.1.bias, base_net.0.1.running_mean, base_net.0.1.running_var, base_net.0.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="246">
					<dim>1</dim>
					<dim>16</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="247" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="247"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="247">
					<dim>1</dim>
					<dim>16</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Multiply_12593" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 1, 3, 3" offset="1804" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Multiply_12330" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="249, base_net.1.1.bias, base_net.1.1.running_mean, base_net.1.1.running_var, base_net.1.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="248">
					<dim>1</dim>
					<dim>16</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_12335" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="2380" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="249" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="249, base_net.1.1.bias, base_net.1.1.running_mean, base_net.1.1.running_var, base_net.1.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="249">
					<dim>1</dim>
					<dim>16</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="250" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="250"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="250">
					<dim>1</dim>
					<dim>16</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Multiply_12601" type="Const" version="opset1">
			<data element_type="f32" shape="32, 16, 1, 1" offset="2444" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Multiply_12337" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="251, 252, base_net.1.4.bias, base_net.1.4.running_mean, base_net.1.4.running_var, base_net.1.4.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_12342" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="4492" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="252" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="252, base_net.1.4.bias, base_net.1.4.running_mean, base_net.1.4.running_var, base_net.1.4.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="252">
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="253" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="253"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="253">
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Multiply_12610" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="4620" size="1152"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Multiply_12344" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="255, base_net.2.1.bias, base_net.2.1.running_mean, base_net.2.1.running_var, base_net.2.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="254">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_12349" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="5772" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="255" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="255, base_net.2.1.bias, base_net.2.1.running_mean, base_net.2.1.running_var, base_net.2.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="255">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="256" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="256"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="256">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Multiply_12618" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 1, 1" offset="5900" size="4096"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Multiply_12351" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="257, 258, base_net.2.4.bias, base_net.2.4.running_mean, base_net.2.4.running_var, base_net.2.4.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_12356" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="9996" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="258" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="258, base_net.2.4.bias, base_net.2.4.running_mean, base_net.2.4.running_var, base_net.2.4.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="258">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="259" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="259"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="259">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Multiply_12627" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="10124" size="1152"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Multiply_12358" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="261, base_net.3.1.bias, base_net.3.1.running_mean, base_net.3.1.running_var, base_net.3.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="260">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_12363" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="11276" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="261" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="261, base_net.3.1.bias, base_net.3.1.running_mean, base_net.3.1.running_var, base_net.3.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="261">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="262" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="262"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="262">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Multiply_12635" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 1, 1" offset="11404" size="4096"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Multiply_12365" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="263, 264, base_net.3.4.bias, base_net.3.4.running_mean, base_net.3.4.running_var, base_net.3.4.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_12370" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="15500" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="264" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="264, base_net.3.4.bias, base_net.3.4.running_mean, base_net.3.4.running_var, base_net.3.4.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="264">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="265" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="265"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="265">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Multiply_12644" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="15628" size="1152"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Multiply_12372" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="267, base_net.4.1.bias, base_net.4.1.running_mean, base_net.4.1.running_var, base_net.4.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="266">
					<dim>1</dim>
					<dim>32</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_12377" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="16780" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="267" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="267, base_net.4.1.bias, base_net.4.1.running_mean, base_net.4.1.running_var, base_net.4.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="267">
					<dim>1</dim>
					<dim>32</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="268" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="268"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="268">
					<dim>1</dim>
					<dim>32</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Multiply_12652" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 1, 1" offset="16908" size="8192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Multiply_12379" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="269, 270, base_net.4.4.bias, base_net.4.4.running_mean, base_net.4.4.running_var, base_net.4.4.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_12384" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="25100" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="270" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="270, base_net.4.4.bias, base_net.4.4.running_mean, base_net.4.4.running_var, base_net.4.4.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="270">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="271" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="271"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="271">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Multiply_12661" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1, 3, 3" offset="25356" size="2304"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Multiply_12386" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="273, base_net.5.1.bias, base_net.5.1.running_mean, base_net.5.1.running_var, base_net.5.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="272">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_12391" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="27660" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="273" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="273, base_net.5.1.bias, base_net.5.1.running_mean, base_net.5.1.running_var, base_net.5.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="273">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="274" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="274"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="274">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Multiply_12669" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 1, 1" offset="27916" size="16384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Multiply_12393" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="275, 276, base_net.5.4.bias, base_net.5.4.running_mean, base_net.5.4.running_var, base_net.5.4.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_12398" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="44300" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="276" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="276, base_net.5.4.bias, base_net.5.4.running_mean, base_net.5.4.running_var, base_net.5.4.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="276">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="277" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="277"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="277">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Multiply_12678" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1, 3, 3" offset="44556" size="2304"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Multiply_12400" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="279, base_net.6.1.bias, base_net.6.1.running_mean, base_net.6.1.running_var, base_net.6.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="278">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_12405" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="46860" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="279" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="279, base_net.6.1.bias, base_net.6.1.running_mean, base_net.6.1.running_var, base_net.6.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="279">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="280" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="280"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="280">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Multiply_12686" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 1, 1" offset="47116" size="16384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Multiply_12407" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="281, 282, base_net.6.4.bias, base_net.6.4.running_mean, base_net.6.4.running_var, base_net.6.4.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_12412" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="63500" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="282" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="282, base_net.6.4.bias, base_net.6.4.running_mean, base_net.6.4.running_var, base_net.6.4.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="282">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="283" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="283"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="283">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Multiply_12695" type="Const" version="opset1">
			<data element_type="f32" shape="8, 64, 1, 1" offset="63756" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Multiply_12414" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="284, 285, base_net.7.branch0.0.bn.bias, base_net.7.branch0.0.bn.running_mean, base_net.7.branch0.0.bn.running_var, base_net.7.branch0.0.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_12419" type="Const" version="opset1">
			<data element_type="f32" shape="1, 8, 1, 1" offset="65804" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="285" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="285, base_net.7.branch0.0.bn.bias, base_net.7.branch0.0.bn.running_mean, base_net.7.branch0.0.bn.running_var, base_net.7.branch0.0.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="285">
					<dim>1</dim>
					<dim>8</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Multiply_12704" type="Const" version="opset1">
			<data element_type="f32" shape="16, 8, 3, 3" offset="65836" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Multiply_12421" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="286, 287, base_net.7.branch0.1.bn.bias, base_net.7.branch0.1.bn.running_mean, base_net.7.branch0.1.bn.running_var, base_net.7.branch0.1.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_12426" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="70444" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="287" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="287, base_net.7.branch0.1.bn.bias, base_net.7.branch0.1.bn.running_mean, base_net.7.branch0.1.bn.running_var, base_net.7.branch0.1.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="287">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="288" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="288"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="288">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Multiply_12713" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 3, 3" offset="70508" size="9216"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Multiply_12428" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="2, 2" pads_begin="2, 2" pads_end="2, 2" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="289, 290, base_net.7.branch0.2.bn.bias, base_net.7.branch0.2.bn.running_mean, base_net.7.branch0.2.bn.running_var, base_net.7.branch0.2.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_12433" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="79724" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="290" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="290, base_net.7.branch0.2.bn.bias, base_net.7.branch0.2.bn.running_mean, base_net.7.branch0.2.bn.running_var, base_net.7.branch0.2.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="290">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Multiply_12722" type="Const" version="opset1">
			<data element_type="f32" shape="8, 64, 1, 1" offset="79788" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Multiply_12435" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="291, 292, base_net.7.branch1.0.bn.bias, base_net.7.branch1.0.bn.running_mean, base_net.7.branch1.0.bn.running_var, base_net.7.branch1.0.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_12440" type="Const" version="opset1">
			<data element_type="f32" shape="1, 8, 1, 1" offset="81836" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="292" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="292, base_net.7.branch1.0.bn.bias, base_net.7.branch1.0.bn.running_mean, base_net.7.branch1.0.bn.running_var, base_net.7.branch1.0.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="292">
					<dim>1</dim>
					<dim>8</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Multiply_12731" type="Const" version="opset1">
			<data element_type="f32" shape="16, 8, 3, 3" offset="81868" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Multiply_12442" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="293, 294, base_net.7.branch1.1.bn.bias, base_net.7.branch1.1.bn.running_mean, base_net.7.branch1.1.bn.running_var, base_net.7.branch1.1.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_12447" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="86476" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="294" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="294, base_net.7.branch1.1.bn.bias, base_net.7.branch1.1.bn.running_mean, base_net.7.branch1.1.bn.running_var, base_net.7.branch1.1.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="294">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="295" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="295"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="295">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Multiply_12740" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 3, 3" offset="86540" size="9216"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Multiply_12449" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="3, 3" pads_begin="3, 3" pads_end="3, 3" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="296, 297, base_net.7.branch1.2.bn.bias, base_net.7.branch1.2.bn.running_mean, base_net.7.branch1.2.bn.running_var, base_net.7.branch1.2.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_12454" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="95756" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="297" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="297, base_net.7.branch1.2.bn.bias, base_net.7.branch1.2.bn.running_mean, base_net.7.branch1.2.bn.running_var, base_net.7.branch1.2.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="297">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Multiply_12749" type="Const" version="opset1">
			<data element_type="f32" shape="8, 64, 1, 1" offset="95820" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Multiply_12456" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="298, 299, base_net.7.branch2.0.bn.bias, base_net.7.branch2.0.bn.running_mean, base_net.7.branch2.0.bn.running_var, base_net.7.branch2.0.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
